[
    {
      "language": "English",
      "dic": {
        "GAME TITLE": "ExplorTech: Learning Galaxy",
        "SPACESHIP SELECT": "SPACESHIP SELECT",
        "OPTIONS": "OPTIONS",
        "QUIT": "QUIT",
        "MUSIC VOLUME": "MUSIC VOLUME",
        "SFX VOLUME": "SFX VOLUME",
        "UI VOLUME": "UI VOLUME",
        "LANGUAGES": "LANGUAGES",
        "CHINESE SIMPLIFIED": "CHINESE SIMPLIFIED",
        "ENGLISH": "ENGLISH",
        "CHANGE LANGUAGE NEED RESTART": "CHANGE LANGUAGE NEED RESTART",
        "Confirm": "Confirm",
        "Cancel": "Cancel",
        "InterstellarExplorer": "Interstellar Explorer",
        "InterstellarExplorerDescription": "The Interstellar Explorer is an advanced spaceship designed for exploring the unknown universe. It was developed due to humanity's urgent desire to uncover hidden secrets and discover new resources in the cosmos. Equipped with advanced detection equipment and navigation systems, the spacecraft can swiftly travel through space and explore various unknown galaxies, planets, and cosmic phenomena. The crew of the Interstellar Explorer comes from different scientific fields, working together to unravel the mysteries and secrets of the universe.",
        "Thunderwing": "Thunderwing",
        "ThunderwingDescription": "Thunderwing is a powerful and deadly combat spaceship widely used in cosmic conflicts and defense missions. It represents the pinnacle of military technology, designed to survive and gain an advantage in intense combat environments. Thunderwing boasts robust armor and advanced weapon systems capable of obliterating enemies with impressive firepower and maneuverability. This ship is often chosen by ambitious military organizations and adventurous warriors.",
        "StellarMerchant": "Stellar Merchant",
        "StellarMerchantDescription": "The Stellar Merchant is a spaceship specifically designed for trade and resource transportation. It is built to swiftly and safely transport goods and resources throughout the cosmos. Equipped with spacious cargo holds and automated logistics systems, the Stellar Merchant ensures efficient and reliable trade and commerce. This ship is often chosen by entrepreneurs and trading corporations to establish prosperous trade networks between star systems.",
        "Guardian": "Guardian",
        "GuardianDescription": "The Guardian is a spaceship specifically designed for support and rescue missions. Its mission is to protect and assist other ships by providing aid and support in hazardous environments. The Guardian is equipped with advanced medical facilities, repair systems, and energy field generators to provide emergency repairs and healing for injured ships. The crew of this ship typically consists of professionals with medical, engineering, and rescue backgrounds.",
        
        "TipContentSpaceship Type" : "Spaceship type",
        "TipContentSpaceship Size" : "The smaller the spaceship, the easier it is to dodge the attack",
        
        "TipContentDurability" : "Increases resilience and survivability in combat.",
        "TipContentShields" : "Provides better defense against enemy attacks.",
        "TipContentFirepower" : "Boosts attack capabilities and damage-dealing abilities.",
        "TipContentEnergy" : "Enables more skills, enhancing combat and travel range.",
        "TipContentAgility" : "Improves maneuverability and evasion of enemy attacks.",
        "TipContentSpeed" : "Enhances movement speed for faster navigation.",
        "TipContentDetection" : "Improves scanning range and reconnaissance capabilities.",
        "TipContentCapacity" : "Enhances cargo-carrying capacity and trading abilities.",
        "TipContentFireRate" : "Higher values mean more rapid and continuous assaults.",
        "TipContentDogde" : "Increases the likelihood of evading enemy attacks."

      }
    }
  ]